{
  "name": "Nataliya",
  "surname": "Dubrovska",
  "whoiam": "Fullstack web developer, Accessibility Specialist",
  "aboutMe": [
    "I am a <strong>hard working</strong>, <strong>pragmatic</strong> and <strong>highly motivated</strong> engineer with a keen interest in technology and all things web. One of my biggest passions is Accessibility as it strongly relates to my personal belief that the internet should be an incredible space for everyone.",
    "<strong>Collaboration</strong> for me is one of the most important aspects of working with a team or organization. I am a <strong>fast learner</strong> who enjoys challenging herself outside of the usual comfort zone. I love mentoring, deliver internal talks on both technical topics and soft skills and <strong>participate in joint projects or hackathons</strong> with my colleagues from various teams.",
    "In addition to helping with community building inside my current place of work, I <strong>volunteer</strong> as a <strong>lead instructor for Code First: Girls</strong>. Recently I also got my first experience <strong>speaking externally</strong> by running a free workshop during OWASP conference.",
    "Outside of work, I am a cat lover, board and computer games geek, who knows way too much about Star Wars."
  ],
  "contacts": {
    "email": {
      "printText": "n.dubrovska89@gmail.com",
      "link": "mailto:n.dubrovska89@gmail.com"
    },
    "linkedin": {
      "printText": "Nataliya Dubrovska",
      "link": "https://www.linkedin.com/in/nataliya-dubrovska-02b2078b/"
    }
  },
  "email": "n.dubrovska89@gmail.com",
  "skills": {
    "technical": [
      {
        "name": "Javascript",
        "additionalInfo": "ES6 onwards, React, JQuery, Node.js, Express, Memoizee, Opossum",
        "level": "4.2"
      },
      {
        "name": "Testing",
        "additionalInfo": "Mocha, Chai, JSDOM, Jest, Enzyme, Webdriver.io, ESlint, SASS lint",
        "level": "4.5"
      },
      {
        "name": "Markup and templating",
        "additionalInfo": "HTML5, Handlebars, EJS",
        "level": "4.8"
      },
      {
        "name": "CSS",
        "additionalInfo": "CSS3, SASS, LESS, BEM",
        "level": "4.5"
      },
      {
        "name": "Asset bundling",
        "additionalInfo": "Gulp, NPM scripts, Webpack, Parcel, Babel",
        "level": "4.5"
      },
      {
        "name": "Accessibility",
        "additionalInfo": "WCAG 2.1, WAI-Aria",
        "level": "4.8"
      },
      {
        "name": "Continious integration / deployment",
        "additionalInfo": "Concourse, Pivotal, Bluemix, Azure, Docker, Docker compose, LogEntries",
        "level": "4"
      }
    ],
    "personal": [
      {
        "name": "Teamwork",
        "additionalInfo": "always putting team first, facilitating and encouraging discussions both inside the team and externally, social secretary",
        "level": "5"
      },
      {
        "name": "Agile",
        "additionalInfo": "Scrum, Kanban, Jira, Trello",
        "level": "4.6"
      },
      {
        "name": "Leadership",
        "additionalInfo": "team lead in training, able to cultivate respect and trust",
        "level": "4.3"
      }
    ]
  },
  "work": [
    {
      "company": "Marks & Spencer",
      "roles": [
        {
          "dates": "April 2017 - current",
          "name": "Senior Software Developer",
          "description": "In this role I am a part of the internal framework team. We created a fully server-side rendered Node-based solution to accomodate the company's shift to DevOps model. This included both cloud hosting and libraries of reusable UI and server components.",
          "responsibilitiesAndProjects": {
            "description": "Due to constraints in resources, at some points I was temporarily sharing the responsibilities of the following roles with my manager",
            "list": [
              "scrum master",
              "product owner",
              "team lead",
              "point of contact for support queries from external stakeholders",
              "mentor for junior members of the team",
              "organiser of weekly brown bag sessions for engineering department and frequent presenter"
            ]
          }
        }
      ]
    },
    {
      "company": "John Lewis",
      "roles": [
        {
          "dates": "August 2015 - March 2017 (Contract - 4 renewals)",
          "name": "Senior Front-End Engineer",
          "description": "My main focus in this role was to act as a front-end lead for a number of transformation projects and provide onboarding for new hires.",
          "responsibilitiesAndProjects": {
            "description": "I was a member of the following product-based Agile teams, working on",
            "list": [
              "making checkout fully responsive on a tight timescale",
              "replatforming of website and creation of internal pattern library",
              "creating a new data driven solution for content driven pages",
              "building front-end portion for the complete overhaul of contact center apps"
            ]
          }
        }
      ]
    },
    {
      "company": "Apple",
      "roles": [
        {
          "dates": "March 2015 - April 2015 (Contract - 2 renewals)",
          "name": "Front-End Developer",
          "description": "Contracted on Apple Consultants Network redesign project."
        },
        {
          "dates": "October 2013 - February 2015",
          "name": "Accessibility Enginner & SME",
          "responsibilitiesAndProjects": {
            "description": "As a member of Accessibility & SEO Center of Excellence I was responsible for",
            "list": [
              "auditing and advising new projects during their whole duration",
              "producing internal training resources",
              "promoting awareness of accessibility around the company"
            ]
          }
        },
        {
          "dates": "October 2011 - October 2013",
          "name": "Graduate Front-End Engineer",
          "description": "As a front-end engineer for the online store, I participated in various day to day activities and projects handled within EMEA region. In addition, I worked as a part of the content publishing team, providing them with the technical support needed to deliver frequent updates across 20+ countries in more than 10 different languages."
        },
        {
          "dates": "July 2010 - September 2010",
          "name": "Intern",
          "description": "My project was to improve the internal solution for sharing of documentation and design decisions. After three months all interns presented to the IT leadership team both in US and Britain. Out of 5 candidates only 3 were given the offer for permanenet employment after graduation."
        }
      ]
    }
  ],
  "education": [
    {
      "name": "Imperial College London",
      "dates": "2009 - 2011",
      "diplomas": [
        "Bachelors of Engineering, Computing"
      ]
    },
    {
      "name": "Filton College (Bristol)",
      "dates": "2007 - 2009",
      "diplomas": [
        "A-levels in: Maths, Further Maths and Physics",
        "AS-levels in: IT and Russian",
        "BTEC National Diploma for IT practitioners"
      ]
    }
  ]
}